Repository: RockxyApp/Rockxy
Catalog: Rockxy/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Re-check the manual proxy entry on the current Wi-Fi; iOS does not use the proxy on cellular or when a VPN bypasses it.
zh_hans: 请重新检查当前 Wi-Fi 上的手动代理条目；iOS 在使用蜂窝网络或 VPN 绕过代理时不会使用该代理。

source: Re-import this custom root and private key, or revert to Rockxy's default root certificate.
zh_hans: 重新导入此自定义根证书和私钥，或恢复使用 Rockxy 的默认根证书。

source: Reach the host via 10.0.2.2
zh_hans: 通过 10.0.2.2 访问主机

source: Reachable
zh_hans: 可访问

source: Reachable from
zh_hans: 可访问来源

source: React Native setup
zh_hans: React Native 设置

source: React Native ships platform guidance, a fetch probe, Android debug XML, and Metro troubleshooting.
zh_hans: React Native 提供平台指南、fetch 探测、Android 调试 XML 和 Metro 故障排除。

source: React Native traffic runs through the native iOS or Android network stack. Set up that device or simulator first, then restart Metro and use the fetch probe, Android debug trust XML, or Metro checklist.
zh_hans: React Native 流量通过原生 iOS 或 Android 网络栈传输。请先设置相应设备或模拟器，然后重新启动 Metro，并使用 fetch 探测、Android 调试信任 XML 或 Metro 检查清单。

source: Read
zh_hans: 读取

source: Read-only
zh_hans: 只读

source: Read-only analysis
zh_hans: 只读分析

source: Read-only Assistant privacy details
zh_hans: 只读助手隐私详情

source: Read-only by default
zh_hans: 默认为只读

source: Read-only preview. This file controls the status and headers; its binary body is preserved but not shown.
zh_hans: 只读预览。此文件控制状态和标头；其二进制正文会被保留，但不会显示。

source: Read-only preview. This file controls the status, ordered headers, and body at request time.
zh_hans: 只读预览。请求时，此文件将控制状态、有序标头和正文。

source: Read-only traffic scope, %lld requests
zh_hans: 只读流量范围，%lld 个请求

source: Readiness
zh_hans: 就绪状态

source: Reading the certificate, Keychain, and macOS trust state.
zh_hans: 正在读取证书、钥匙串和 macOS 信任状态。

source: Ready
zh_hans: 就绪

source: Ready for HTTPS interception
zh_hans: HTTPS 拦截已就绪

source: Ready for new connections. Repeat the request.
zh_hans: 已准备好接受新连接。请再次发送请求。

source: Ready on start
zh_hans: 启动时就绪

source: Ready to verify
zh_hans: 准备就绪，可验证

source: Realtime subscription lifecycle
zh_hans: 实时订阅生命周期

source: Rebuilding the reviewed context with the excluded traffic
zh_hans: 正在使用排除后的流量重建审查上下文

source: Receive from %@?
zh_hans: 从 %@ 接收？

source: Receive Rockxy iOS Session
zh_hans: 接收 Rockxy iOS 会话

source: Received
zh_hans: 已接收

source: Recheck
zh_hans: 重新检查

source: Recheck Status
zh_hans: 重新检查状态

source: Reconnect...
zh_hans: 重新连接...

source: Record matching traffic
zh_hans: 记录匹配的流量

source: Recording
zh_hans: 正在记录

source: Recording paused
zh_hans: 记录已暂停

source: Recording Paused
zh_hans: 记录已暂停

source: Recovery Suggestion
zh_hans: 恢复建议

source: Red
zh_hans: 红色

source: Redact recognized sensitive data
zh_hans: 对识别到的敏感数据脱敏

source: Redact Sensitive Data Before Sending to AI
zh_hans: 发送到 AI 前对敏感数据脱敏

source: Redacting sensitive fields
zh_hans: 正在对敏感字段脱敏

source: Redaction
zh_hans: 脱敏

source: Redaction is off. Captured headers, URLs, and bodies upload exactly as recorded.
zh_hans: 脱敏功能已关闭。捕获的标头、URL 和正文将完全按记录内容上传。

source: Redaction Manifest
zh_hans: 脱敏清单

source: Redacts recognized sensitive headers, URLs, and body values (Authorization, Cookie, API keys) before upload. Best-effort, not a guarantee.
zh_hans: 上传前会对识别出的敏感标头、URL 和正文值（Authorization、Cookie、API 密钥）脱敏。此操作会尽力而为，但不作保证。

source: Referenced By
zh_hans: 引用者

source: Refresh available models
zh_hans: 刷新可用模型

source: Refresh Available Models
zh_hans: 刷新可用模型

source: Refresh or replace the credential, then retry the request.
zh_hans: 请刷新或替换凭据，然后重试请求。

source: Refresh Status
zh_hans: 刷新状态

source: Refresh to discover models available from this provider.
zh_hans: 刷新以发现此提供商可用的模型。

source: Regenerate Babylon Pairing Token?
zh_hans: 重新生成 Babylon 配对令牌？

source: Regenerate Token
zh_hans: 重新生成令牌

source: Regenerate…
zh_hans: 重新生成…

source: Regex directory rules need a capture group, such as /assets/(.*), to choose a file inside the directory.
zh_hans: 正则表达式目录规则需要一个捕获组（例如 /assets/(.*)），用于选择目录内的文件。

source: Regex directory rules use the first capture group as the relative file path.
zh_hans: 正则表达式目录规则使用第一个捕获组作为相对文件路径。

source: Regex pattern is too long.
zh_hans: 正则表达式模式过长。

source: Registration:
zh_hans: 注册：

source: Regular expressions are limited to 2,048 characters.
zh_hans: 正则表达式不能超过 2,048 个字符。

source: Regular expressions are validated before the rule is saved.
zh_hans: 正则表达式会在规则保存之前进行验证。

source: Reinstall
zh_hans: 重新安装

source: Reinstall Helper
zh_hans: 重新安装辅助工具

source: Reinstall the app after the certificate is trusted
zh_hans: 信任证书后重新安装 App

source: Related found
zh_hans: 已找到相关项

source: Related Requests
zh_hans: 相关请求

source: Related requests are included only when you opt in.
zh_hans: 仅在你选择加入时才会包含相关请求。

source: Related Traffic Scope
zh_hans: 相关流量范围

source: Release builds may not trust user CAs
zh_hans: 发布构建可能不信任用户 CA

source: Release Notes
zh_hans: 发布说明

source: Release notes are unavailable for the latest published version.
zh_hans: 最新发布版本没有可用的发布说明。

source: Release notes are unavailable for this update.
zh_hans: 此更新没有可用的发布说明。

source: Release notes couldn’t be loaded for this update.
zh_hans: 无法加载此更新的发行说明。

source: Release notes for this local build are unavailable because this version is not published to the update feed yet.
zh_hans: 此本地版本的发行说明不可用，因为该版本尚未发布到更新源。

source: Reload
zh_hans: 重新加载

source: Remote Destination
zh_hans: 远程目标

source: Remote model endpoints must use HTTPS. Plain HTTP is allowed only on this Mac.
zh_hans: 远程模型端点必须使用 HTTPS。仅允许在这台 Mac 上使用纯 HTTP。

source: Remove
zh_hans: 移除

source: Remove %lld Entries
zh_hans: 移除 %lld 个条目

source: Remove Authorization
zh_hans: 移除 Authorization

source: Remove Credential
zh_hans: 移除凭据

source: Remove from Full Proxy Bypass
zh_hans: 从完全代理绕过中移除

source: Remove Highlight
zh_hans: 移除高亮显示

source: Remove Local Model?
zh_hans: 移除本地模型？

source: Remove model from Ollama
zh_hans: 从 Ollama 移除模型

source: Remove Note
zh_hans: 移除备注

source: Remove operation
zh_hans: 移除操作

source: Remove operation %lld
zh_hans: 移除操作 %lld

source: Remove Provider
zh_hans: 移除提供商

source: Remove Selected
zh_hans: 移除选定项

source: Remove selected bypass entries?
zh_hans: 移除所选绕过条目？

source: Remove Selected Columns
zh_hans: 移除所选列

source: Remove Selected Entries
zh_hans: 移除所选条目

source: Remove Selected Rules
zh_hans: 移除所选规则

source: Remove the manual Wi-Fi proxy and remove the Rockxy certificate profile from the device when you are done debugging.
zh_hans: 调试完成后，请移除手动 Wi-Fi 代理，并从设备中移除 Rockxy 证书描述文件。

source: Remove the selected request from the Library.
zh_hans: 从资料库中移除所选请求。

source: Remove: ⌥⌘N
zh_hans: 移除：⌥⌘N

# Removed %@ from %@.
source: Removed %1$@ from %2$@.
zh_hans: 已从 %2$@ 移除 %1$@。

source: Removed %@ from Ollama.
zh_hans: 已从 Ollama 中移除 %@。

source: Removing a saved column only removes its table configuration — it never deletes captured traffic or history.
zh_hans: 移除已保存的列只会移除其表格配置，绝不会删除捕获的流量或历史记录。

source: Rename
zh_hans: 重命名

source: Rename Conversation
zh_hans: 重命名对话

source: Rename Folder
zh_hans: 重命名文件夹

source: Rename Project
zh_hans: 重命名项目

source: Rename Project…
zh_hans: 重命名项目…

source: Rename Tab
zh_hans: 重命名标签页

source: Rename Tab…
zh_hans: 重命名标签页…

source: Rename…
zh_hans: 重命名…

source: Rendering Body...
zh_hans: 正在渲染正文...

source: Rendering Hex...
zh_hans: 正在渲染十六进制...

source: Rendering Preview...
zh_hans: 正在渲染预览...

source: Reopen Required
zh_hans: 需要重新打开

source: Reopen Rockxy to continue
zh_hans: 重新打开 Rockxy 以继续

source: Repair & Reinstall
zh_hans: 修复并重新安装

source: Repair & Reinstall…
zh_hans: 修复并重新安装…

source: Repair Helper Tool?
zh_hans: 修复辅助工具？

source: Repair Projects…
zh_hans: 修复项目…

source: Repair Trust
zh_hans: 修复信任

source: Repeat
zh_hans: 重复

source: Repeated host errors
zh_hans: 重复的主机错误

source: Replace Allow List Rules?
zh_hans: 替换允许列表规则？

source: Replace existing Full Proxy Bypass entries?
zh_hans: 替换现有的完全代理绕过条目？

source: Replace existing HTTPS decryption settings?
zh_hans: 替换现有 HTTPS 解密设置？

source: Replace Session
zh_hans: 替换会话

source: Replay
zh_hans: 重放

source: Replay completed — %lld
zh_hans: 重放完成 — %lld

source: Replay failed — %@
zh_hans: 重放失败 — %@

source: Replay is not supported for this request type.
zh_hans: 此请求类型不支持重放。

source: Replay this request
zh_hans: 重放此请求

source: Report Bug…
zh_hans: 报告错误…

source: Request
zh_hans: 请求

source: Request + Response
zh_hans: 请求 + 响应

source: Request Behavior
zh_hans: 请求行为

source: Request Body
zh_hans: 请求正文

source: Request Body Options
zh_hans: 请求正文选项

source: Request Body...
zh_hans: 请求正文...

source: Request Cookies
zh_hans: 请求 Cookie

source: Request Headers
zh_hans: 请求标头

source: Request ID
zh_hans: 请求 ID

source: Request Line
zh_hans: 请求行

source: Request line must be METHOD target HTTP/version.
zh_hans: 请求行必须为 METHOD target HTTP/version。

source: Request line must end with an HTTP version.
zh_hans: 请求行必须以 HTTP 版本结尾。

source: Request message type
zh_hans: 请求消息类型

source: Request method
zh_hans: 请求方法

source: Request method must contain only letters.
zh_hans: 请求方法只能包含字母。

source: Request note
zh_hans: 请求备注

source: Request Options
zh_hans: 请求选项

source: Request paused for review
zh_hans: 请求已暂停以供审查

source: Request section
zh_hans: 请求部分

source: Request Section
zh_hans: 请求部分

source: Request subpaths resolve inside this directory. Root requests use index.html when it exists.
zh_hans: 请求子路径会在此目录中解析。如果存在 index.html，根请求将使用该文件。

source: Request subpaths resolve to files inside this directory. Root requests and missing files continue to the origin.
zh_hans: 请求子路径会解析为此目录内的文件。根路径请求和缺失的文件将继续发送到源服务器。

source: Request Summary
zh_hans: 请求摘要

source: Request target is empty.
zh_hans: 请求目标为空。

source: Request Template
zh_hans: 请求模板

source: Request Templates
zh_hans: 请求模板

source: Request Timeout
zh_hans: 请求超时

source: Request URL
zh_hans: 请求 URL

source: Requests
zh_hans: 请求

source: Requests affected by a matching debugging rule
zh_hans: 受匹配调试规则影响的请求

source: Requests must be recorded to run the capture check.
zh_hans: 必须记录请求才能运行捕获检查。

source: Requests outside the bound
zh_hans: 边界之外的请求

source: Requests taking at least one second
zh_hans: 耗时至少一秒的请求

source: Requests with notes appear here. Add a note to a request to track it.
zh_hans: 带备注的请求会显示在此处。为请求添加备注即可进行跟踪。

source: Requests you save appear here. Save a request from its menu to keep it across sessions.
zh_hans: 你保存的请求会显示在这里。从请求菜单中保存，即可跨会话保留。

source: Requires Approval
zh_hans: 需要批准

source: Reset
zh_hans: 重置

source: Reset all Rockxy Certificates
zh_hans: 重置所有 Rockxy 证书

source: Reset all Rockxy Certificates?
zh_hans: 重置所有 Rockxy 证书？

source: Reset Background Items
zh_hans: 重置后台项

source: Reset Certificate
zh_hans: 重置证书

source: Reset Certificates
zh_hans: 重置证书

source: Reset Defaults
zh_hans: 重置为默认值

source: Reset failed: %@
zh_hans: 重置失败：%@

source: Reset Filters
zh_hans: 重置筛选条件

source: Reset macOS Login and Background Items data?
zh_hans: 重置 macOS 登录项和后台项数据？

source: Reset Message
zh_hans: 重置消息

source: Reset Projects
zh_hans: 重置项目

source: Reset Projects?
zh_hans: 重置项目？

source: Reset Projects…
zh_hans: 重置项目…

source: Reset Raw Message
zh_hans: 重置原始消息

source: Reset Shared State
zh_hans: 重置共享状态

source: Reset Shared State…
zh_hans: 重置共享状态…

source: Reset to Default
zh_hans: 重置为默认

source: Reset to Fresh Request
zh_hans: 重置为全新请求

source: Resolve the externally changed Upstream Proxy settings before applying.
zh_hans: 应用前，请先解决外部更改的上游代理设置。

source: Responding with %@
zh_hans: 正在响应 %@

source: Response
zh_hans: 响应

source: Response Body
zh_hans: 响应正文

source: Response body display options
zh_hans: 响应正文显示选项

source: Response body is incomplete
zh_hans: 响应正文不完整

source: Response body was truncated during capture
zh_hans: 捕获期间响应正文被截断

source: Response Body...
zh_hans: 响应正文...

source: Response Cookies
zh_hans: 响应 Cookie

source: Response delay
zh_hans: 响应延迟

source: Response Headers
zh_hans: 响应标头

source: Response line must be HTTP/version status.
zh_hans: 响应行必须为 HTTP/版本 状态。

source: Response line must start with an HTTP version.
zh_hans: 响应行必须以 HTTP 版本开头。

source: Response message type
zh_hans: 响应消息类型

source: Response paused for review
zh_hans: 响应已暂停以供审查

source: Response section
zh_hans: 响应部分

source: Response Section
zh_hans: 响应部分

source: Response Size
zh_hans: 响应大小

source: Response Source
zh_hans: 响应来源

source: Response status and headers
zh_hans: 响应状态码和标头

source: Response status must be a three-digit code.
zh_hans: 响应状态码必须是三位数。

source: Response Template
zh_hans: 响应模板

source: Response Templates
zh_hans: 响应模板

source: Responses
zh_hans: 响应

source: Responses larger than 1 MB are saved as separate files.
zh_hans: 大于 1 MB 的响应会另存为单独文件。

source: Restart Metro and the app after proxy changes
zh_hans: 更改代理后，重新启动 Metro 和 App

source: Restore Defaults
zh_hans: 恢复默认设置

source: Restore this conversation's traffic before following up.
zh_hans: 继续操作前，请恢复此对话的流量。

source: Restore this conversation's traffic or start a new conversation.
zh_hans: 恢复此对话的流量，或开始新对话。

source: Restore Traffic
zh_hans: 恢复流量

source: Restored from history
zh_hans: 已从历史记录恢复

source: Result
zh_hans: 结果

source: Resume Recording
zh_hans: 恢复记录

source: Resume recording new traffic. ⌥⌘R
zh_hans: 恢复捕获新流量。⌥⌘R

source: Resume recording so new requests appear in the traffic list.
zh_hans: 恢复记录，以便新请求出现在流量列表中。

source: Resume recording so new requests are captured.
zh_hans: 恢复记录，以便捕获新请求。

source: Retrieval
zh_hans: 检索

source: Retry
zh_hans: 重试

source: Retry Connection
zh_hans: 重试连接

source: Retry decryption and repeat the request. If the app rejects it again, leave this host tunneled.
zh_hans: 重试解密并再次发送请求。如果 App 再次拒绝，请让此主机继续通过隧道传输。

source: Retry HTTPS decryption for %@ on the next connection
zh_hans: 在下次连接时重试对 %@ 的 HTTPS 解密

source: Retry Listener
zh_hans: 重试监听器

source: Retry once. If it fails again, compare the server response with a successful request.
zh_hans: 重试一次。如果再次失败，请将服务器响应与一个成功的请求进行比较。

source: Retry Termination
zh_hans: 重试终止

source: Retry Verification
zh_hans: 重试验证

source: Return 403 Forbidden
zh_hans: 返回 403 Forbidden

source: Return 403 Forbidden or drop matching client connections.
zh_hans: 返回 403 Forbidden，或断开匹配的客户端连接。

source: Reusable raw HTTP messages for paused traffic.
zh_hans: 用于已暂停流量的可重复使用原始 HTTP 消息。

source: Reveal in Finder
zh_hans: 在 Finder 中显示

source: Reveal in Main Window
zh_hans: 在主窗口中显示

source: Reveal Request
zh_hans: 显示请求

source: Reveal the generated setup script so you can inspect exactly what it exports
zh_hans: 显示生成的设置脚本，以便检查它导出的确切内容

source: Reveal the request behind this finding
zh_hans: 显示此发现背后的请求

source: Revert
zh_hans: 还原

source: Revert to Default Root Certificate?
zh_hans: 还原为默认根证书？

source: Revert to Default…
zh_hans: 恢复为默认…

source: Review & Retry
zh_hans: 查看并重试

source: Review & Share…
zh_hans: 审查并共享…

source: Review before model access
zh_hans: 模型访问前审查

source: Review credential presence and authentication response signals.
zh_hans: 审查凭据是否存在以及身份验证响应信号。

source: Review Data
zh_hans: 审查数据

source: Review Data & Run Model
zh_hans: 审查数据并运行模型

source: Review or Revoke Application Authorization.
zh_hans: 审查或撤销应用程序授权。

source: Review retrieved sources, score, and sensitive-data risk before sharing traces.
zh_hans: 共享追踪记录前，请审查检索到的来源、评分和敏感数据风险。

source: Review Rule Impact above.
zh_hans: 请审查上方的规则影响。

source: Review the AI Assistant trust boundary
zh_hans: 审查 AI 助手信任边界

source: Review the exact redacted payload before copying or sharing any evidence.
zh_hans: 复制或共享任何证据前，请审查经过脱敏的确切有效载荷。

source: Review the four setup steps before continuing.
zh_hans: 继续之前请查看这四个设置步骤。

source: Review the highlighted Upstream Proxy settings.
zh_hans: 查看突出显示的上游代理设置。

source: Review the latest release details for Rockxy.
zh_hans: 查看 Rockxy 的最新发布详情。

source: Review the matched rule before sharing.
zh_hans: 共享前请审查匹配的规则。

source: Review this capture before it loads into the current session.
zh_hans: 在将此捕获加载到当前会话前进行审查。

source: Review what leaves this Mac before uploading to GitHub.
zh_hans: 上传到 GitHub 前，审查将离开这台 Mac 的内容。

source: Reviewed Content Size
zh_hans: 已审查内容大小

source: Rewrite matching requests to a different host, port, path, or query.
zh_hans: 将匹配的请求重写到其他主机、端口、路径或查询。

source: Rewrite requests and responses with JavaScript before they continue.
zh_hans: 在请求和响应继续传输前，使用 JavaScript 重写它们。

source: Right
zh_hans: 右侧

source: Right text
zh_hans: 右侧文本

# Rockxy %@ is now available. You’re currently using %@.
source: Rockxy %1$@ is now available. You’re currently using %2$@.
zh_hans: Rockxy %1$@ 现已可用。你当前使用的是 %2$@。

source: Rockxy %@ is ready to install.
zh_hans: Rockxy %@ 已准备好安装。

source: Rockxy binds IPv4 only. IPv6 dual-stack listening isn't available yet.
zh_hans: Rockxy 仅绑定 IPv4。目前尚不支持 IPv6 双栈监听。

source: Rockxy blocked %lld model action request(s).
zh_hans: Rockxy 阻止了 %lld 个模型操作请求。

source: Rockxy can identify this AI app session, but model, tokens, and tools need decrypted API evidence.
zh_hans: Rockxy 可以识别此 AI App 会话，但模型、token 和工具需要解密后的 API 证据。

source: Rockxy can share this Mac's public Root CA over a temporary local link, while Android still requires manual proxy, user CA, and debug trust configuration; release builds generally will not trust user CAs.
zh_hans: Rockxy 可通过临时本地链接共享这台 Mac 的公开根 CA，而 Android 仍需手动配置代理、用户 CA 和调试信任；发布构建通常不会信任用户 CA。

source: Rockxy can share this Mac's public Root CA over a temporary local link, while iOS still requires you to install and trust it manually on the device.
zh_hans: Rockxy 可以通过临时本地链接共享这台 Mac 的公开根 CA，但 iOS 仍要求你在设备上手动安装并信任它。

source: Rockxy cannot access this custom root certificate and its private key.
zh_hans: Rockxy 无法访问此自定义根证书及其私钥。

source: Rockxy cannot confirm the request outcome from this transaction.
zh_hans: Rockxy 无法从此事务确认请求结果。

source: Rockxy could not identify every rejecting client.
zh_hans: Rockxy 无法识别所有拒绝证书的客户端。

source: Rockxy cannot inspect response headers or payload for this request.
zh_hans: Rockxy 无法检查此请求的响应标头或有效载荷。

source: Rockxy cannot read the certificate and trust status right now.
zh_hans: Rockxy 目前无法读取证书和信任状态。

source: Rockxy cannot read the certificate and trust status right now. Nothing was changed — check the status again once your keychain is available.
zh_hans: Rockxy 目前无法读取证书和信任状态。未做任何更改——待钥匙串可用后请重新检查状态。

source: Rockxy cannot verify the Root CA trust status, so HTTPS interception is paused. HTTP traffic and logs are still captured.
zh_hans: Rockxy 无法验证根 CA 的信任状态，因此 HTTPS 拦截已暂停。HTTP 流量和日志仍会被捕获。

source: Rockxy cannot write to %@. Choose another install folder.
zh_hans: Rockxy 无法写入 %@。请选择其他安装文件夹。

source: Rockxy captured the gRPC frame, but heuristic Protobuf decoding could not infer a safe tree.
zh_hans: Rockxy 已捕获该 gRPC 帧，但启发式 Protobuf 解码无法推断出安全的树结构。

source: Rockxy captured the local validation probe and can reveal it in the main window.
zh_hans: Rockxy 已捕获本地验证探测，并可在主窗口中显示它。

source: Rockxy Certificate is ready.
zh_hans: Rockxy 证书已就绪。

source: Rockxy could not communicate with the helper over XPC.
zh_hans: Rockxy 无法通过 XPC 与辅助工具通信。

source: Rockxy could not compute the Root CA fingerprint. Stop sharing and regenerate the Root CA before installing it on another device.
zh_hans: Rockxy 无法计算根 CA 指纹。在另一台设备上安装前，请停止共享并重新生成根 CA。

source: Rockxy could not find the root CA private key.
zh_hans: Rockxy 找不到根 CA 私钥。

source: Rockxy could not fully recover the custom certificate store. Restart Rockxy before making more certificate changes.
zh_hans: Rockxy 无法完全恢复自定义证书存储。进一步更改证书前，请重新启动 Rockxy。

source: Rockxy could not include the excluded traffic. The reviewed data is unchanged.
zh_hans: Rockxy 无法包含已排除的流量。审查的数据未发生变化。

source: Rockxy could not load the default root certificate details.
zh_hans: Rockxy 无法加载默认根证书的详细信息。

source: Rockxy could not read the Keychain or trust state. Nothing was changed.
zh_hans: Rockxy 无法读取钥匙串或信任状态。未做任何更改。

source: Rockxy could not read the certificate status, so nothing was changed. Recheck the status once your keychain is available.
zh_hans: Rockxy 无法读取证书状态，因此未做任何更改。待钥匙串可用后请重新检查状态。

source: Rockxy could not prepare the Full Proxy Bypass export.
zh_hans: Rockxy 无法准备完全代理绕过导出内容。

source: Rockxy could not prepare the HTTPS Decryption export.
zh_hans: Rockxy 无法准备 HTTPS 解密导出。

source: Rockxy could not render the reviewed context as UTF-8.
zh_hans: Rockxy 无法将审查的上下文渲染为 UTF-8。

source: Rockxy could not start the local validation probe. Reopen Developer Setup, then try again.
zh_hans: Rockxy 无法启动本地验证探针。请重新打开开发者设置，然后重试。

source: Rockxy could not start the temporary certificate sharing server.
zh_hans: Rockxy 无法启动临时的证书共享服务器。

source: Rockxy could not verify this app copy — install a fresh copy before using the helper tool
zh_hans: Rockxy 无法验证此应用副本 — 请在使用辅助工具之前安装一个全新副本

source: Rockxy could not verify this app copy. Install a fresh copy of Rockxy, then check the helper again.
zh_hans: Rockxy 无法验证此 App 副本。请安装全新的 Rockxy 副本，然后再次检查辅助工具。

source: Rockxy could not verify this app copy. Open diagnostics before continuing.
zh_hans: Rockxy 无法验证此应用副本。请先打开诊断再继续。

source: Rockxy decrypts HTTPS for hosts matching this pattern.
zh_hans: Rockxy 会解密与此模式匹配的主机的 HTTPS 流量。

source: Rockxy Default Root Certificate
zh_hans: Rockxy 默认根证书

source: Rockxy did not capture a completed response for this request.
zh_hans: Rockxy 未捕获到此请求的完整响应。

source: Rockxy does not automate system-level certificate installation; if you need it, use a writable emulator image and the standard adb remount flow yourself.
zh_hans: Rockxy 不会自动安装系统级证书；如有需要，请使用可写的模拟器映像，并自行执行标准 adb remount 流程。

source: Rockxy does not automate tvOS or watchOS pairing
zh_hans: Rockxy 不会自动完成 tvOS 或 watchOS 配对

source: Rockxy does not automate tvOS or watchOS pairing today; use this page for the same prerequisites that apply to iOS devices and simulators.
zh_hans: Rockxy 目前不会自动完成 tvOS 或 watchOS 配对；请使用此页面了解与 iOS 设备和模拟器相同的前提条件。

source: Rockxy does not collect analytics or crash reports. Captured traffic stays on your machine unless you explicitly export, share, or publish it.
zh_hans: Rockxy 不收集分析或崩溃报告。捕获的流量会留在你这台 Mac 上，除非你明确导出、共享或发布。

source: Rockxy does not drive simctl or inject the certificate into a simulator; reinstall or cold-launch the target app after the certificate is trusted.
zh_hans: Rockxy 不会驱动 simctl，也不会将证书注入模拟器；信任证书后，请重新安装或冷启动目标 App。

source: Rockxy does not ship a dedicated Vision Pro pairing flow; follow the iOS Device page for the same manual steps.
zh_hans: Rockxy 未提供专门的 Vision Pro 配对流程；请按照 iOS 设备页面执行相同的手动步骤。

source: Rockxy downloads this PAC file when resolving a new route.
zh_hans: Rockxy 在解析新路由时会下载此 PAC 文件。

source: Rockxy found no captured 401 or 403 response for this request.
zh_hans: Rockxy 未找到此请求的已捕获 401 或 403 响应。

source: Rockxy found no captured HTTP failure status for the selected request.
zh_hans: Rockxy 未发现所选请求有已捕获的 HTTP 失败状态。

source: Rockxy generates a local root Certificate Authority (CA) to create per-host certificates for HTTPS traffic interception. The root CA must be installed and trusted in your macOS Keychain. No certificate data leaves your machine.
zh_hans: Rockxy 会生成本地根证书颁发机构 (CA)，以便为每个主机创建证书并拦截 HTTPS 流量。必须在 macOS 钥匙串中安装并信任根 CA。任何证书数据都不会离开这台 Mac。

source: Rockxy generates a scoped setup script before launching.
zh_hans: Rockxy 会在启动前生成限定范围的设置脚本。

source: Rockxy has not generated a root certificate yet.
zh_hans: Rockxy 尚未生成根证书。

source: Rockxy import replaces the current rules, master state, and TLS passthrough exceptions. Export first if you need a backup.
zh_hans: Rockxy 导入会替换当前规则、主开关状态和 TLS 直通例外。如需备份，请先导出。

source: Rockxy is already preparing %@. Wait for that launch to finish, then try again.
zh_hans: Rockxy 已在准备 %@。请等待该启动流程完成后再试。

source: Rockxy is capturing traffic on this Mac.
zh_hans: Rockxy 正在这台 Mac 上捕获流量。

source: Rockxy is capturing. Send a request through the proxy and it will appear here.
zh_hans: Rockxy 正在捕获。通过代理发送请求后，它会显示在这里。

source: Rockxy is comparing your current build against the signed update feed.
zh_hans: Rockxy 正在将当前构建与已签名的更新源进行比较。

source: Rockxy is downloading the signed update and verifying it before installation.
zh_hans: Rockxy 正在下载已签名的更新，并在安装前进行验证。
